Revit 2024 API
BuiltInFailures.SteelElementFailures.SteelElementModifyParametersTaskNotFinished Property
 Cannot modify parameters while background calculations are in progress.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SteelElementModifyParametersTaskNotFinished { get; }
Visual Basic
Public Shared ReadOnly Property SteelElementModifyParametersTaskNotFinished As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SteelElementModifyParametersTaskNotFinished {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SteelElementFailures Class
Autodesk.Revit.DB Namespace